# coding:utf-8

import gensim

model = gensim.models.KeyedVectors.load_word2vec_format('model.vec', binary=False)

print(model.most_similar(positive=['麻婆豆腐']))

# 日本人: [('韓国人', 0.7338133454322815), ('中国人', 0.717720627784729), ('アメリカ人', 0.6725355982780457), ('日本人女性', 0.6723321676254272), ('外国人', 0.6420464515686035), ('フィリピン人', 0.6264426708221436), ('欧米人', 0.621786892414093), ('アジア人', 0.6192302703857422), ('台湾人', 0.6034690141677856), ('日系人', 0.5906497240066528)]
# [('ポケモンXY', 0.8050551414489746), ('ポケモンXD', 0.7923538684844971), ('ポケモントレーナー', 0.7631847262382507), ('ピカチュウ', 0.7623766660690308), ('ポケモン図鑑', 0.75491863489151), ('ポケットモンスター', 0.7538669109344482), ('ポケモンキッズ', 0.7482787370681763), ('ポケモンBW', 0.7361546754837036), ('サトシのポケモン', 0.7307371497154236), ('ポケモンファン', 0.7289283871650696)]
# japaneseもtennisもなぜか判定なし
# model.most_similar(positive=['tennis'])
# model.most_similar(positive=['japanese'])
